Tekla Open API Reference for Tekla Structures 2025
Rectangle.Angle Property
 The angle of the rectangle. The rectangle rotates around its start point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Angle { get; set; }
Public Property Angle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Rectangle Class
Tekla.Structures.Drawing Namespace